Ran Plan for project: `k8s-infra` dir: `k8s-infra` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding latest version of yandex-cloud/yandex...
- Installing yandex-cloud/yandex v0.140.1...
- Installed yandex-cloud/yandex v0.140.1 (unauthenticated)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Incomplete lock file information for providers
│ 
│ Due to your customized provider installation methods, Terraform was forced
│ to calculate lock file checksums locally for the following providers:
│   - yandex-cloud/yandex
│ 
│ The current .terraform.lock.hcl file only includes checksums for
│ linux_amd64, so Terraform running on another platform will fail to install
│ these providers.
│ 
│ To calculate additional checksums for another platform, run:
│   terraform providers lock -platform=linux_amd64
│ (where linux_amd64 is the platform to generate)
╵
Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # yandex_compute_instance.public_instance[0] must be replaced
-/+ resource "yandex_compute_instance" "public_instance" {
      ~ created_at                = "2025-04-16T11:03:44Z" -> (known after apply)
      ~ folder_id                 = "b1gue9v1tapk50i3uj7m" -> (known after apply)
      ~ fqdn                      = "fhmomv0gvso05u4orndr.auto.internal" -> (known after apply)
      + gpu_cluster_id            = (known after apply)
      ~ hardware_generation       = [
          - {
              - generation2_features = []
              - legacy_features      = [
                  - {
                      - pci_topology = "PCI_TOPOLOGY_V1"
                    },
                ]
            },
        ] -> (known after apply)
      + hostname                  = (known after apply)
      ~ id                        = "fhmomv0gvso05u4orndr" -> (known after apply)
      - labels                    = {} -> null
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
        name                      = "public-vm-1"
      + service_account_id        = (known after apply)
      ~ status                    = "running" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ boot_disk {
          ~ device_name = "fhmkuppljtk0ojo9m5c0" -> (known after apply)
          ~ disk_id     = "fhmkuppljtk0ojo9m5c0" -> (known after apply)
          ~ mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              ~ block_size  = 4096 -> (known after apply)
              + description = (known after apply)
              + name        = (known after apply)
              ~ size        = 10 -> 15 # forces replacement
              + snapshot_id = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - aws_v1_http_endpoint = 1 -> null
          - aws_v1_http_token    = 2 -> null
          - gce_http_endpoint    = 1 -> null
          - gce_http_token       = 1 -> null
        }

      ~ network_interface {
          ~ index              = 0 -> (known after apply)
          ~ ip_address         = "10.0.1.17" -> (known after apply)
          ~ ipv6               = false -> (known after apply)
          + ipv6_address       = (known after apply)
          ~ mac_address        = "d0:0d:18:b7:c1:0f" -> (known after apply)
          ~ nat_ip_address     = "158.160.110.247" -> (known after apply)
          ~ nat_ip_version     = "IPV4" -> (known after apply)
          ~ security_group_ids = [] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ placement_policy (known after apply)
      - placement_policy {
          - host_affinity_rules       = [] -> null
          - placement_group_partition = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ resources {
          - gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p k8s-infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=iveisberg%252FDevOps-Engineer-Diploma-Terraform%252Fk8s-infra%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p k8s-infra
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```